{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.7.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "improved_model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 41], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Bidirectional", "config": {"name": "bidirectional", "trainable": true, "dtype": "float32", "layer": {"class_name": "GRU", "config": {"name": "gru", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 150, "activation": "relu", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.1, "recurrent_dropout": 0.1, "implementation": 1, "reset_after": false}}, "merge_mode": "concat"}, "name": "bidirectional", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "dtype": "float32", "layer": {"class_name": "GRU", "config": {"name": "gru_1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 150, "activation": "relu", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.1, "recurrent_dropout": 0.1, "implementation": 1, "reset_after": false}}, "merge_mode": "concat"}, "name": "bidirectional_1", "inbound_nodes": [[["bidirectional", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense", 0, 0]]}}, "training_config": {"loss": {"class_name": "SparseCategoricalCrossentropy", "config": {"reduction": "auto", "name": "sparse_categorical_crossentropy", "from_logits": false}}, "metrics": [[{"class_name": "SparseCategoricalAccuracy", "config": {"name": "sparse_categorical_accuracy", "dtype": "float32"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.00019999999494757503, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional/forward_gru/gru_cell_1/kernel", "shape": [41, 450], "dtype": "float32"}, {"name": "bidirectional/forward_gru/gru_cell_1/recurrent_kernel", "shape": [150, 450], "dtype": "float32"}, {"name": "bidirectional/forward_gru/gru_cell_1/bias", "shape": [450], "dtype": "float32"}, {"name": "bidirectional/backward_gru/gru_cell_2/kernel", "shape": [41, 450], "dtype": "float32"}, {"name": "bidirectional/backward_gru/gru_cell_2/recurrent_kernel", "shape": [150, 450], "dtype": "float32"}, {"name": "bidirectional/backward_gru/gru_cell_2/bias", "shape": [450], "dtype": "float32"}, {"name": "bidirectional_1/forward_gru_1/gru_cell_4/kernel", "shape": [300, 450], "dtype": "float32"}, {"name": "bidirectional_1/forward_gru_1/gru_cell_4/recurrent_kernel", "shape": [150, 450], "dtype": "float32"}, {"name": "bidirectional_1/forward_gru_1/gru_cell_4/bias", "shape": [450], "dtype": "float32"}, {"name": "bidirectional_1/backward_gru_1/gru_cell_5/kernel", "shape": [300, 450], "dtype": "float32"}, {"name": "bidirectional_1/backward_gru_1/gru_cell_5/recurrent_kernel", "shape": [150, 450], "dtype": "float32"}, {"name": "bidirectional_1/backward_gru_1/gru_cell_5/bias", "shape": [450], "dtype": "float32"}, {"name": "dense/kernel", "shape": [300, 4], "dtype": "float32"}, {"name": "dense/bias", "shape": [4], "dtype": "float32"}]}]}